In [1]:
import os
import configparser
from sqlalchemy import create_engine
import sqlalchemy.sql

mycfg = configparser.ConfigParser()
mycfg.read("/home/jovyan/Spring_23/3287/weatherundergroundData/mysql.cfg")
print(f"User    : [{mycfg['mysql']['user']}]")
database = mycfg['mysql']['url'].split('@')[1]  # leave off the password
print(f"Database: [[mysql://{mycfg['mysql']['user']}...@{database}]")

db_url = mycfg['mysql']['url'] 
os.environ['DATABASE_URL'] = db_url 
eng = create_engine(db_url)
con = eng.connect()

User    : [kaso6442]
Database: [[mysql://kaso6442...@www.db4free.net:3306/kaso6442_weather]

In [2]:
%reload_ext sql
print ("get version...")
%sql SELECT version()

get version...
1 rows affected.

[('8.0.33',)]

In [3]:
%%sql

DROP TABLE IF EXISTS locations;

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
0 rows affected.

[]

In [4]:
%%sql
CREATE TABLE locations (
    ID VARCHAR(4) PRIMARY KEY,
    city VARCHAR(20) NOT NULL
);

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
0 rows affected.

[]

In [5]:
%%sql
INSERT INTO locations VALUES('kclt', 'Charlotte, NC');
INSERT INTO locations VALUES('kcqt', 'Los Angeles, CA');
INSERT INTO locations VALUES('khou', 'Houston, TX');
INSERT INTO locations VALUES('kind', 'Indianapolis, IN');
INSERT INTO locations VALUES('kjax', 'Jacksonville, FL');
INSERT INTO locations VALUES('kmdw', 'Chicago, IL');
INSERT INTO locations VALUES('knyc', 'New York City, NY');
INSERT INTO locations VALUES('kphl', 'Philadelphia, PA');
INSERT INTO locations VALUES('kphx', 'Pheonix, AZ');
INSERT INTO locations VALUES('ksea', 'Seattle, WA');

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [6]:
%%sql
SELECT * FROM locations;

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
10 rows affected.

[('kclt', 'Charlotte, NC'),
 ('kcqt', 'Los Angeles, CA'),
 ('khou', 'Houston, TX'),
 ('kind', 'Indianapolis, IN'),
 ('kjax', 'Jacksonville, FL'),
 ('kmdw', 'Chicago, IL'),
 ('knyc', 'New York City, NY'),
 ('kphl', 'Philadelphia, PA'),
 ('kphx', 'Pheonix, AZ'),
 ('ksea', 'Seattle, WA')]

In [8]:
%%sql
SELECT * from kcqt
LIMIT 3;

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
3 rows affected.

[('date', 'actual_mean_temp', 'actual_min_temp', 'actual_max_temp', 'average_min_temp', 'average_max_temp', 'record_min_temp', 'record_max_temp', 'record_min_temp_year', 'record_max_temp_year', 'actual_precipitation', 'average_precipitation', 'record_precipitation'),
 ('2014-7-1', '70', '63', '77', '63', '82', '52', '107', '1886', '1985', '0.00', '0.00', '0.09'),
 ('2014-7-2', '70', '62', '77', '63', '82', '51', '102', '1887', '1985', '0.00', '0.00', '0.00')]

In [13]:
%%sql
SELECT DISTINCT TABLE_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME IN 
( SELECT TABLE_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE COLUMN_NAME = 'COL 8' )

## https://stackoverflow.com/questions/23752116/mysql-select-all-tables-with-multiple-specific-columns Dhwani's answer ##

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
9 rows affected.

[('ksea',),
 ('kphx',),
 ('kphl',),
 ('knyc',),
 ('kmdw',),
 ('kjax',),
 ('kind',),
 ('khou',),
 ('kclt',)]

In [18]:
for i in ['kclt', 'khou', 'kind', 'kjax', 'kmdw', 'knyc', 'kphl', 'kphx', 'ksea']:
        con.execute("""ALTER TABLE %s RENAME COLUMN `COL 2` TO actual_mean_temp"""%i)
        con.execute("""ALTER TABLE %s RENAME COLUMN `COL 3` TO actual_min_temp"""%i)
        con.execute("""ALTER TABLE %s RENAME COLUMN `COL 4` TO actual_max_temp"""%i)
        con.execute("""ALTER TABLE %s RENAME COLUMN `COL 5` TO average_min_temp"""%i)
        con.execute("""ALTER TABLE %s RENAME COLUMN `COL 6` TO average_max_temp"""%i)
        con.execute("""ALTER TABLE %s RENAME COLUMN `COL 7` TO record_min_temp"""%i)
        con.execute("""ALTER TABLE %s RENAME COLUMN `COL 8` TO record_max_temp"""%i)
        con.execute("""ALTER TABLE %s RENAME COLUMN `COL 9` TO record_min_temp_year"""%i)
        con.execute("""ALTER TABLE %s RENAME COLUMN `COL 10` TO record_max_temp_year"""%i)
        con.execute("""ALTER TABLE %s RENAME COLUMN `COL 11` TO actual_precipitation"""%i)
        con.execute("""ALTER TABLE %s RENAME COLUMN `COL 12` TO average_precipitation"""%i)
        con.execute("""ALTER TABLE %s RENAME COLUMN `COL 13` TO record_precipitation"""%i)

In [20]:
for i in ['kclt', 'khou', 'kind', 'kjax', 'kmdw', 'knyc', 'kphl', 'kphx', 'ksea']:
    con.execute("""DELETE FROM %s LIMIT 1"""%i)

In [32]:
con.execute("""DELETE FROM kcqt LIMIT 1""")

In [21]:
%%sql
SELECT * from kphx
LIMIT 3;

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
3 rows affected.

[('2014-7-1', '98', '86', '109', '82', '107', '65', '115', '1927', '1990', '0.00', '0.02', '2.68'),
 ('2014-7-2', '98', '86', '109', '82', '107', '65', '118', '1911', '2011', '0.00', '0.01', '2.81'),
 ('2014-7-3', '94', '79', '108', '82', '107', '64', '117', '1916', '1907', '0.0', '0.02', '0.22')]

In [33]:
%%sql
SELECT * FROM kcqt
LIMIT 3;

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
3 rows affected.

[('2014-7-1', '70', '63', '77', '63', '82', '52', '107', '1886', '1985', '0.00', '0.00', '0.09'),
 ('2014-7-2', '70', '62', '77', '63', '82', '51', '102', '1887', '1985', '0.00', '0.00', '0.00'),
 ('2014-7-3', '72', '63', '81', '63', '82', '52', '100', '1902', '1985', '0.00', '0.00', '0.00')]

In [38]:
%%sql
SELECT DISTINCT(record_max_temp)
FROM kcqt
ORDER BY record_max_temp ASC

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
32 rows affected.

[('100',),
 ('101',),
 ('102',),
 ('103',),
 ('104',),
 ('105',),
 ('106',),
 ('107',),
 ('108',),
 ('109',),
 ('110',),
 ('112',),
 ('113',),
 ('80',),
 ('81',),
 ('83',),
 ('84',),
 ('85',),
 ('86',),
 ('87',),
 ('88',),
 ('89',),
 ('90',),
 ('91',),
 ('92',),
 ('93',),
 ('94',),
 ('95',),
 ('96',),
 ('97',),
 ('98',),
 ('99',)]

In [39]:
%%sql
describe kcqt

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
13 rows affected.

[('date', 'varchar(10)', 'YES', '', None, ''),
 ('actual_mean_temp', 'varchar(16)', 'YES', '', None, ''),
 ('actual_min_temp', 'varchar(15)', 'YES', '', None, ''),
 ('actual_max_temp', 'varchar(15)', 'YES', '', None, ''),
 ('average_min_temp', 'varchar(16)', 'YES', '', None, ''),
 ('average_max_temp', 'varchar(16)', 'YES', '', None, ''),
 ('record_min_temp', 'varchar(15)', 'YES', '', None, ''),
 ('record_max_temp', 'varchar(15)', 'YES', '', None, ''),
 ('record_min_temp_year', 'varchar(20)', 'YES', '', None, ''),
 ('record_max_temp_year', 'varchar(20)', 'YES', '', None, ''),
 ('actual_precipitation', 'varchar(20)', 'YES', '', None, ''),
 ('average_precipitation', 'varchar(21)', 'YES', '', None, ''),
 ('record_precipitation', 'varchar(20)', 'YES', '', None, '')]

In [ ]:
for i in ['kcqt', 'kclt', 'khou', 'kind', 'kjax', 'kmdw', 'knyc', 'kphl', 'kphx', 'ksea']:
    con.execute("""ALTER TABLE %s MODIFY actual_mean_temp INTEGER"""%i)
    con.execute("""ALTER TABLE %s MODIFY actual_min_temp INTEGER"""%i)
    con.execute("""ALTER TABLE %s MODIFY actual_max_temp INTEGER"""%i)
    con.execute("""ALTER TABLE %s MODIFY average_min_temp INTEGER"""%i)
    con.execute("""ALTER TABLE %s MODIFY average_max_temp INTEGER"""%i)
    con.execute("""ALTER TABLE %s MODIFY record_min_temp INTEGER"""%i)
    con.execute("""ALTER TABLE %s MODIFY record_max_temp INTEGER"""%i)
    con.execute("""ALTER TABLE %s MODIFY record_min_temp_year INTEGER"""%i)
    con.execute("""ALTER TABLE %s MODIFY record_max_temp_year INTEGER"""%i)
    con.execute("""ALTER TABLE %s MODIFY actual_precipitation INTEGER"""%i)
    con.execute("""ALTER TABLE %s MODIFY average_precipitation INTEGER"""%i)
    con.execute("""ALTER TABLE %s MODIFY record_precipitation INTEGER"""%i)

In [ ]:
%%sql
describe kcqt